In [13]:
import numpy as np
import pandas as pd

In [14]:
df=pd.read_csv("C:/Users/kushal/Desktop/LeetCode-Files/Statistics/income.csv")

In [15]:
df

        Name    income
0        Rob      5000
1      Rafiq      6000
2       Nina      4000
3      Sofia      7500
4      Mohan      8000
5        Tao      7000
6  Elon Musk  10000000

In [16]:
df.describe()

             income
count  7.000000e+00
mean   1.433929e+06
std    3.777283e+06
min    4.000000e+03
25%    5.500000e+03
50%    7.000000e+03
75%    7.750000e+03
max    1.000000e+07

In [22]:
percentile_100=df.income.quantile(1)

In [23]:
df_outlier=df[df.income<percentile_100]

In [24]:
df_outlier

    Name  income
0    Rob    5000
1  Rafiq    6000
2   Nina    4000
3  Sofia    7500
4  Mohan    8000
5    Tao    7000

In [ ]:
# df_null_replace=df.fillna(df.income.median())